<?php


namespace App\Faker;

use Faker\Provider\Base;
use Faker\Factory as FakerFactory;

class CityFaker extends Base
{
    protected static $usedCities = [];

    protected static $cities = [

        "القاهرة" => [
            '15 مايو',
            'الازبكية',
            'البساتين',
            'التبين',
            'الخليفة',
            'الدراسة',
            'الدرب الاحمر',
            'الزاوية الحمراء',
            'الزيتون',
            'الساحل',
            'السلام',
            'السيدة زينب',
            'الشرابية',
            'مدينة الشروق',
            'الظاهر',
            'العتبة',
            'القاهرة الجديدة',
            'المرج',
            'عزبة النخل',
            'المطرية',
            'المعادى',
            'المعصرة',
            'المقطم',
            'المنيل',
            'الموسكى',
            'النزهة',
            'الوايلى',
            'باب الشعرية',
            'بولاق',
            'جاردن سيتى',
            'حدائق القبة',
            'حلوان',
            'دار السلام',
            'شبرا',
            'طره',
            'عابدين',
            'عباسية',
            'عين شمس',
            'مدينة نصر',
            'مصر الجديدة',
            'مصر القديمة',
            'منشية ناصر',
            'مدينة بدر',
            'مدينة العبور',
            'وسط البلد',
            'الزمالك',
            'قصر النيل',
            'الرحاب',
            'القطامية',
            'مدينتي',
            'روض الفرج',
            'شيراتون',
            'الجمالية',
            'العاشر من رمضان',
            'الحلمية',
            'النزهة الجديدة',
            'العاصمة الإدارية',
            /* End Cairo ID:1 */
        ],
        "الجيزة" => [
            /* Start Giza ID:2 */
            'الجيزة',
            'السادس من أكتوبر',
            'الشيخ زايد',
            'الحوامدية',
            'البدرشين',
            'الصف',
            'أطفيح',
            'العياط',
            'الباويطي',
            'منشأة القناطر',
            'أوسيم',
            'كرداسة',
            'أبو النمرس',
            'كفر غطاطي',
            'منشأة البكاري',
            'الدقى',
            'العجوزة',
            'الهرم',
            'الوراق',
            'امبابة',
            'بولاق الدكرور',
            'الواحات البحرية',
            'العمرانية',
            'المنيب',
            'بين السرايات',
            'الكيت كات',
            'المهندسين',
            'فيصل',
            'أبو رواش',
            'حدائق الأهرام',
            'الحرانية',
            'حدائق اكتوبر',
            'صفط اللبن',
            'القرية الذكية',
            'ارض اللواء',
            /* End Giza ID:2 */
        ],

        "الأسكندرية" => [
            /* Start Alexandria ID:3 */
            'ابو قير',
            'الابراهيمية',
            'الأزاريطة',
            'الانفوشى',
            'الدخيلة',
            'السيوف',
            'العامرية',
            'اللبان',
            'المفروزة',
            'المنتزه',
            'المنشية',
            'الناصرية',
            'امبروزو',
            'باب شرق',
            'برج العرب',
            'ستانلى',
            'سموحة',
            'سيدى بشر',
            'شدس',
            'غيط العنب',
            'فلمينج',
            'فيكتوريا',
            'كامب شيزار',
            'كرموز',
            'محطة الرمل',
            'مينا البصل',
            'العصافرة',
            'العجمي',
            'بكوس',
            'بولكلي',
            'كليوباترا',
            'جليم',
            'المعمورة',
            'المندرة',
            'محرم بك',
            'الشاطبي',
            'سيدي جابر',
            'الساحل الشمالي',
            'الحضرة',
            'العطارين',
            'سيدي كرير',
            'الجمرك',
            'المكس',
            'مارينا',
            /* End Alexandria ID:3 */
        ],
        "الدقهلية" => [
            /* Start Dakahlia ID:4 */
            'المنصورة',
            'طلخا',
            'ميت غمر',
            'دكرنس',
            'أجا',
            'منية النصر',
            'السنبلاوين',
            'الكردي',
            'بني عبيد',
            'المنزلة',
            'تمي الأمديد',
            'الجمالية',
            'شربين',
            'المطرية',
            'بلقاس',
            'ميت سلسيل',
            'جمصة',
            'محلة دمنة',
            'نبروه',
            /* End Dakahlia ID:4 */
        ],
        "البحر الأحمر" => [
            /* Start Red Sea ID:5 */
            'الغردقة',
            'رأس غارب',
            'سفاجا',
            'القصير',
            'مرسى علم',
            'الشلاتين',
            'حلايب',
            'الدهار',
            /* End Red Sea ID:5 */
        ],

        "البحيرة" => [

            /* Start Beheira ID:6 */
            'دمنهور',
            'كفر الدوار',
            'رشيد',
            'إدكو',
            'أبو المطامير',
            'أبو حمص',
            'الدلنجات',
            'المحمودية',
            'الرحمانية',
            'إيتاي البارود',
            'حوش عيسى',
            'شبراخيت',
            'كوم حمادة',
            'بدر',
            'وادي النطرون',
            'النوبارية الجديدة',
            'النوبارية',
            /* End Beheira ID:6 */
        ],

        "الفيوم" => [
            /* Start Fayoum ID:7 */
            'الفيوم',
            'الفيوم الجديدة',
            'طامية',
            'سنورس',
            'إطسا',
            'إبشواي',
            'يوسف الصديق',
            'الحادقة',
            'اطسا',
            'الجامعة',
            'السيالة',
            /* End Fayoum ID:7 */
        ],
        "الغربية" => [
            /* Start Gharbia ID:8 */
            'طنطا',
            'المحلة الكبرى',
            'كفر الزيات',
            'زفتى',
            'السنطة',
            'قطور',
            'بسيون',
            'سمنود',
            /* End Gharbia ID:8 */
        ],

        "الإسماعلية" => [

            /* Start Ismailia ID:9 */
            'الإسماعيلية',
            'فايد',
            'القنطرة شرق',
            'القنطرة غرب',
            'التل الكبير',
            'أبو صوير',
            'القصاصين الجديدة',
            'نفيشة',
            'الشيخ زايد',
            /* End Ismailia ID:9 */
        ],

        "المنوفية" => [
            /* Start Monufya ID:10 */
            'شبين الكوم',
            'مدينة السادات',
            'منوف',
            'سرس الليان',
            'أشمون',
            'الباجور',
            'قويسنا',
            'بركة السبع',
            'تلا',
            'الشهداء',
            /* Start Monufya ID:10 */
        ],

        "المنيا" => [
            /* Start Minya ID:11 */
            'المنيا',
            'المنيا الجديدة',
            'العدوة',
            'مغاغة',
            'بني مزار',
            'مطاي',
            'سمالوط',
            'المدينة الفكرية',
            'ملوي',
            'دير مواس',
            'ابو قرقاص',
            'ارض سلطان',
            /* End Minya ID:11 */
        ],

        "القليوبية" => [
            /* Start Qalubia ID:12 */
            'بنها',
            'قليوب',
            'شبرا الخيمة',
            'القناطر الخيرية',
            'الخانكة',
            'كفر شكر',
            'طوخ',
            'قها',
            'العبور',
            'الخصوص',
            'شبين القناطر',
            'مسطرد',
            /* End Qalubia ID:12 */
        ],

        "الوادي الجديد" => [
            /* Start New Valley ID:13 */
            'الخارجة',
            'باريس',
            'موط',
            'الفرافرة',
            'بلاط',
            'الداخلة',
            /* End New Valley ID:13 */
        ],

        "السويس" => [
            /* Start South Sinai ID:14 */
            'السويس',
            'الجناين',
            'عتاقة',
            'العين السخنة',
            'فيصل',
            /* End South Sinai ID:14 */
        ],

        "اسوان" => [
            /* Start Aswan ID:15 */
            'أسوان',
            'أسوان الجديدة',
            'دراو',
            'كوم أمبو',
            'نصر النوبة',
            'كلابشة',
            'إدفو',
            'الرديسية',
            'البصيلية',
            'السباعية',
            'ابوسمبل السياحية',
            'مرسى علم',
            /* End Aswan ID:15 */
        ],

        "اسيوط" => [
            /* Start Assiut ID:16 */
            'أسيوط',
            'أسيوط الجديدة',
            'ديروط',
            'منفلوط',
            'القوصية',
            'أبنوب',
            'أبو تيج',
            'الغنايم',
            'ساحل سليم',
            'البداري',
            'صدفا',
            /* End Assiut ID:16 */
        ],

        "بني سويف" => [
            /* Start Bani Sweif ID:17 */
            'بني سويف',
            'بني سويف الجديدة',
            'الواسطى',
            'ناصر',
            'إهناسيا',
            'ببا',
            'الفشن',
            'سمسطا',
            'الاباصيرى',
            'مقبل',
            /* End Bani Sweif ID:17 */
        ],

        "بورسعيد" => [
            /* Start PorSaid ID:18 */
            'بورسعيد',
            'بورفؤاد',
            'العرب',
            'حى الزهور',
            'حى الشرق',
            'حى الضواحى',
            'حى المناخ',
            'حى مبارك',
            /* End PorSaid ID:18 */
        ],

        "دمياط" => [
            /* Start Damietta ID:19 */
            'دمياط',
            'دمياط الجديدة',
            'رأس البر',
            'فارسكور',
            'الزرقا',
            'السرو',
            'الروضة',
            'كفر البطيخ',
            'عزبة البرج',
            'ميت أبو غالب',
            'كفر سعد',
            /* End Damietta ID:19 */
        ],

        "الشرقية" => [
            /* Start Sharqia ID:20 */
            'الزقازيق',
            'العاشر من رمضان',
            'منيا القمح',
            'بلبيس',
            'مشتول السوق',
            'القنايات',
            'أبو حماد',
            'القرين',
            'ههيا',
            'أبو كبير',
            'فاقوس',
            'الصالحية الجديدة',
            'الإبراهيمية',
            'ديرب نجم',
            'كفر صقر',
            'أولاد صقر',
            'الحسينية',
            'صان الحجر القبلية',
            'منشأة أبو عمر',
            /* End Sharqia ID:20 */
        ],

        "جنوب سيناء" => [
            /* Start South Sinai ID:21 */
            'الطور',
            'شرم الشيخ',
            'دهب',
            'نويبع',
            'طابا',
            'سانت كاترين',
            'أبو رديس',
            'أبو زنيمة',
            'رأس سدر',
            /* End South Sinai ID:21 */
        ],

        "كفر الشيخ" => [
            /* Start Kafr El Sheikh ID:22 */
            'كفر الشيخ',
            'وسط البلد كفر الشيخ',
            'دسوق',
            'فوه',
            'مطوبس',
            'برج البرلس',
            'بلطيم',
            'مصيف بلطيم',
            'الحامول',
            'بيلا',
            'الرياض',
            'سيدي سالم',
            'قلين',
            'سيدي غازي',
            /* End Kafr El Sheikh ID:22 */
        ],

        "مطروح" => [
            /* Start Matrouh ID:23 */
            'مرسى مطروح',
            'الحمام',
            'العلمين',
            'الضبعة',
            'النجيلة',
            'سيدي براني',
            'السلوم',
            'سيوة',
            'مارينا',
            'الساحل الشمالى',
            /* End Matrouh ID:23 */
        ],

        "الأقصر" => [
            /* Start Luxor ID:24 */
            'الأقصر',
            'الأقصر الجديدة',
            'إسنا',
            'طيبة الجديدة',
            'الزينية',
            'البياضية',
            'القرنة',
            'أرمنت',
            'الطود',
            /* End Luxor ID:24 */
        ],

        "قنا" => [
            /* Start Qena ID:25 */
            'قنا',
            'قنا الجديدة',
            'ابو طشت',
            'نجع حمادي',
            'دشنا',
            'الوقف',
            'قفط',
            'نقادة',
            'فرشوط',
            'قوص',
            /* End Qena ID:25 */
        ],

        "شمال سيناء" => [
            /* Start North Sinai ID:26 */
            'العريش',
            'الشيخ زويد',
            'نخل',
            'رفح',
            'بئر العبد',
            'الحسنة',
            /* End North Sinai ID:26 */
        ],

        "سوهاج" => [
            /* Start Sohag ID:27 */
            'سوهاج',
            'سوهاج الجديدة',
            'أخميم',
            'أخميم الجديدة',
            'البلينا',
            'المراغة',
            'المنشأة',
            'دار السلام',
            'جرجا',
            'جهينة الغربية',
            'ساقلته',
            'طما',
            'طهطا',
            'الكوثر'
            /* End Sharqia ID:27 */
        ],




        // "الرياض" => [
        //     "الرياض",
        //     "الخرج",
        //     "الدوادمي",
        //     "الزلفي",
        //     "رماح",
        //     "حريملاء",
        //     "الدرعية",
        //     "ضرما"
        // ],
        // "مكة المكرمة" => [
        //     "جدة",
        //     "الطائف",
        //     "رابغ",
        //     "القنفذة",
        //     "أضم"
        // ],
        // "المنطقة الشرقية" => [
        //     "الدمام",
        //     "الخبر",
        //     "القطيف",
        //     "هجرة لبن",
        //     "رأس تنورة"
        // ],
        // "المدينة المنورة" => [
        //     "المدينة المنورة",
        //     "ينبع",
        //     "الحناكية",
        //     "بدر",
        //     "خيبر",
        //     "المهد",
        //     "العلا"
        // ]
    ];

    /**
     * الحصول على اسم دولة وكودها بدون تكرار
     */
    public static function uniqueCity()
    {


        // احصل على جميع المحافظات المتاحة التي لا تزال بها مدن غير مستخدمة
        $availableGovernorates = array_filter(static::$cities, function ($cities, $governorate) {
            // حساب عدد المدن المستخدمة لهذه المحافظة
            $usedCitiesForGovernorate = array_filter(static::$usedCities, function ($usedCity) use ($governorate) {
                return $usedCity['governorate'] === $governorate;
            });
            // إذا كانت المدن المتاحة أكثر من المستخدمة
            return count($cities) > count($usedCitiesForGovernorate);
        }, ARRAY_FILTER_USE_BOTH);
        
        if (empty($availableGovernorates)) {
            static::$usedCities = [];  // نعيد ضبط القائمة لتبدأ من جديد
            $availableGovernorates = static::$cities; //نأخذ كل المحافظات من جديد
        }
        
        // اختر محافظة عشوائية
        $governorate = array_rand($availableGovernorates); // اسم المحافظة
        $cities = $availableGovernorates[$governorate]; // قائمة مدن هذه المحافظة
        
        // احصل على المدن التي لم يتم استخدامها لهذه المحافظة
        $usedCityNames = array_map(function ($usedCity) {
            return $usedCity['name']; // نأخذ أسماء المدن المستخدمة فقط
        }, array_filter(static::$usedCities, function ($usedCity) use ($governorate) {
            return $usedCity['governorate'] === $governorate; // فقط مدن هذه المحافظة
        }));
        
        $availableCities = array_diff($cities, $usedCityNames); // المدن الغير مستخدمة بعد

        if (empty($availableCities)) { // نعيد المحاولة مع محافظة أخرى
            // إذا تم استخدام جميع المدن لهذه المحافظة، حاول استخدام محافظة أخرى
            return static::uniqueCity();
        }

        // اختر مدينة عشوائية
        $cityName = $availableCities[array_rand($availableCities)]; // اسم المدينة العشوائية

        // قم بوضع علامة على هذه المدينة على أنها مستخدمة
        static::$usedCities[] = [
            'governorate' => $governorate,
            'name' => $cityName,
        ];

        return [
            'governorate_id' => $governorate,
            'name' => $cityName,
        ];
    }
}

// $faker = FakerFactory::create();
// $cityFaker = new CityFaker($faker);
// $cityData = $cityFaker->uniqueCity();

// dd($cityData);