<?php

namespace App\Faker;

use Faker\Provider\Base;


class JobCategoryFaker extends Base
{
    protected static $usedCategories = [];

    protected static $categories = [

        "محاسب",
        "مراجع حسابات",
        "مدير مالي",
        "محلل مالي",
        "خبير ضرائب",
        "مبرمج",
        "مطور ويب",
        "مهندس برمجيات",
        "محلل نظم",
        "أخصائي أمن معلومات",
        "معلم",
        "أستاذ جامعي",
        "مدرب",
        "مرشد أكاديمي",
        "مشرف تربوي",
        "مهندس مدني",
        "مهندس ميكانيكي",
        "مهندس كهرباء",
        "مهندس معماري",
        "مهندس صناعي",
        "طبيب",
        "ممرض",
        "صيدلي",
        "أخصائي علاج طبيعي",
        "طبيب أسنان",
        "مدير تسويق",
        "منفذ مبيعات",
        "أخصائي تسويق رقمي",
        "مندوب مبيعات",
        "محلل أسواق",
        "أخصائي توظيف",
        "مدير موارد بشرية",
        "أخصائي تدريب وتطوير",
        "أخصائي رواتب",
        "مستشار موارد بشرية",
        "صحفي",
        "مذيع",
        "محرر",
        "متخصص علاقات عامة",
        "مدير اتصالات",
        "مصمم جرافيك",
        "مصمم أزياء",
        "فنان تشكيلي",
        "مصور",
        "مخرج فني",
        "مدير سلسلة توريد",
        "أخصائي شحن وتخليص",
        "مدير مستودعات",
        "منسق شحن",
        "أخصائي توزيع",
        "مدير فندق",
        "مرشد سياحي",
        "منسق فعاليات",
        "أخصائي حجوزات",
        "طاهٍ",
        "محامي",
        "مستشار قانوني",
        "كاتب عدل",
        "باحث قانوني",
        "محقق",
        "باحث علمي",
        "أخصائي مختبرات",
        "عالم بيانات",
        "مختص في الذكاء الاصطناعي",
        "باحث طبي",
        "مهندس موقع",
        "مدير مشروع بناء",
        "مشرف بناء",
        "فني إنشاءات",
        "مساح",
        "مدير مصنع",
        "مشرف إنتاج",
        "فني صيانة",
        "مراقب جودة",
        "مشغل آلات",
        "مدير متجر",
        "بائع",
        "أمين مخزن",
        "مندوب خدمة عملاء",
        "مشرف مبيعات",
        "مهندس زراعي",
        "أخصائي تربة",
        "مدير مزرعة",
        "فني ري",
        "خبير أغذية",
        "طيار",
        "مهندس طيران",
        "مضيف جوي",
        "مراقب جوي",
        "فني صيانة طائرات",
        "موظف حكومي",
        "أخصائي علاقات عامة",
        "مدير إدارة حكومية",
        "باحث إحصائي",
        "منسق مشاريع حكومية",
    ];


    public function uniquejobCategoryName()
    {
        $available = array_diff(static::$categories, static::$usedCategories);
        if (empty($available)) {
            throw new \Exception("No unique unique job Category left.");
        }

        $categories = static::randomElement($available);
        static::$usedCategories[] = $categories;
        return $categories;
    }
}