<?php

namespace App\Faker;

use Faker\Provider\Base;


class NationalityFaker extends Base
{
    protected static $useduniqueNationalities = [];
    protected static $nationalities = [
        'مصري',
        'سعودي',
        'سوري',
        'أردني',
        'فلسطيني',
        'لبناني',
        'عراقي',
        'كويتي',
        'قطري',
        'إماراتي',
        'بحريني',
        'عُماني',
        'يمني',
        'ليبي',
        'جزائري',
        'تونسي',
        'مغربي',
        'سوداني',
        'موريتاني',
        'جيبوتي',
        'صومالي',
        'تركي',
        'إيراني',
        'أفغاني',
        'باكستاني',
        'هندي',
        'بنغلاديشي',
        'فلبيني',
        'صيني',
        'ياباني',
        'كوريا الجنوبية',
        'كوريا الشمالية',
        'تايلندي',
        'إندونيسي',
        'ماليزيي',
        'سنغافوري',
        'فيتنامي',
        'لاوسي',
        'كمبودي',
        'ميانماري',
        'أسترالي',
        'نيوزيلندي',
        'جنوب أفريقي',
        'نيجيري',
        'كينيي',
        'إثيوبي',
        'إريتري',
        'تشادي',
        'أنغولي',
        'كاميروني',
        'مالي',
        'النيجر',
        'بوركيني',
        'رواندي',
        'أوغندي',
        'كونغولي',
        'سنغالي',
        'غامبي',
        'غيني',
        'ليبيري',
        'سيراليوني',
        'توغولي',
        'غاني',
        'زيمبابوي',
        'زامبي',
        'مالاوي',
        'ناميبي',
        'بوتسواني',
        'موزمبيقي',
        'تنزاني',
        'برازيلي',
        'أرجنتيني',
        'كولومبي',
        'بيروفي',
        'تشيلي',
        'فنزويلي',
        'أورغوياني',
        'باراغواي',
        'بوليفي',
        'كندي',
        'أمريكي',
        'مكسيكي',
        'كوبي',
        'بنمي',
        'كوستاريكي',
        'هندوراسي',
        'غواتيمالي',
        'نيكاراغوي',
        'سلفادوري',
        'بريطاني',
        'فرنسي',
        'ألماني',
        'إيطالي',
        'إسباني',
        'برتغالي',
        'سويسري',
        'هولندي',
        'بلجيكي',
        'نمساوي',
        'سويدي',
        'نرويجي',
        'دنماركي',
        'فنلندي',
        'روسي',
        'أوكراني'
    ];

    public function uniqueNationalityName()
    {
        $available = array_diff(static::$nationalities, static::$useduniqueNationalities);
        if (empty($available)) {
            throw new \Exception("No unique nationalities left.");
        }

        $nationalities = static::randomElement($available);
        static::$useduniqueNationalities[] = $nationalities;
        return $nationalities;
    }
}